# Data Wrangling

### Numpy -
- N-dimensional array = ndarray
- collection of same type of items
- zero based index

In [1]:
import numpy as np
a = np.array([[1,2], 
            [3,4]])
print (a)

[[1 2]
 [3 4]]

In [2]:
#dtype
b = np.array([1,2,3,4], dtype = complex)
print (b)

[1.+0.j 2.+0.j 3.+0.j 4.+0.j]

### Series -
- 1D labeled array
- Labels = Indexes

In [3]:
# Create series from the numpy array created above
import pandas as pd
pd.Series(b)

0    1.000000+0.000000j
1    2.000000+0.000000j
2    3.000000+0.000000j
3    4.000000+0.000000j
dtype: complex128

### Dataframe -
- 2D

In [4]:
data = {'Name':['Astha','Puri'],
       'Age':['10','20']}
df = pd.DataFrame(data,index=['First','Second'])
print (df)

         Name Age
First   Astha  10
Second   Puri  20

### Dealing with missing values
- fillna(scalar)
- forward fill: fillna(pad)
- backward fill: fillna(bfill)
- drop row with missing values: dropna(axis=0)
- drop column with missing value: dropna(axis=1)

In [11]:
df = pd.DataFrame(np.random.randn(5,3),
                 index = ['a','c','e','f','h'],
                 columns = ['one','two','three'])
print (df)

        one       two     three
a  0.805553 -1.585596  1.134240
c -0.474664 -0.487816  1.063223
e  0.508310  0.216957  0.756748
f  0.034740  0.350896 -0.949703
h  0.570360  0.420157 -0.509846

In [12]:
# Introduce missing values to this dataframe
df = df.reindex(['a','b','c','d','e','f','g','h'])
print(df)

        one       two     three
a  0.805553 -1.585596  1.134240
b       NaN       NaN       NaN
c -0.474664 -0.487816  1.063223
d       NaN       NaN       NaN
e  0.508310  0.216957  0.756748
f  0.034740  0.350896 -0.949703
g       NaN       NaN       NaN
h  0.570360  0.420157 -0.509846

In [13]:
# Check for missing values in first column
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [14]:
# Replace NaN with scalar
df1 = df.fillna(0)
print(df1)

        one       two     three
a  0.805553 -1.585596  1.134240
b  0.000000  0.000000  0.000000
c -0.474664 -0.487816  1.063223
d  0.000000  0.000000  0.000000
e  0.508310  0.216957  0.756748
f  0.034740  0.350896 -0.949703
g  0.000000  0.000000  0.000000
h  0.570360  0.420157 -0.509846

In [16]:
# Fill forward
df2 = df.fillna(method='pad')
print(df2)

        one       two     three
a  0.805553 -1.585596  1.134240
b  0.805553 -1.585596  1.134240
c -0.474664 -0.487816  1.063223
d -0.474664 -0.487816  1.063223
e  0.508310  0.216957  0.756748
f  0.034740  0.350896 -0.949703
g  0.034740  0.350896 -0.949703
h  0.570360  0.420157 -0.509846

In [17]:
# Fill backward
df3 = df.fillna(method='bfill')
print(df3)

        one       two     three
a  0.805553 -1.585596  1.134240
b -0.474664 -0.487816  1.063223
c -0.474664 -0.487816  1.063223
d  0.508310  0.216957  0.756748
e  0.508310  0.216957  0.756748
f  0.034740  0.350896 -0.949703
g  0.570360  0.420157 -0.509846
h  0.570360  0.420157 -0.509846

In [18]:
# Drop missing values along axis = 0, i.e row
df4 = df.dropna(axis=0)
print(df4)

        one       two     three
a  0.805553 -1.585596  1.134240
c -0.474664 -0.487816  1.063223
e  0.508310  0.216957  0.756748
f  0.034740  0.350896 -0.949703
h  0.570360  0.420157 -0.509846

In [20]:
# Drop missing values along axis = 1, i.e column
df5 = df.dropna(axis=1)
print(df5)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

### Replacing data

In [22]:
print(df1)

        one       two     three
a  0.805553 -1.585596  1.134240
b  0.000000  0.000000  0.000000
c -0.474664 -0.487816  1.063223
d  0.000000  0.000000  0.000000
e  0.508310  0.216957  0.756748
f  0.034740  0.350896 -0.949703
g  0.000000  0.000000  0.000000
h  0.570360  0.420157 -0.509846

In [25]:
# Replace 0 with 10
df1.replace({0:10})

         one        two      three
a   0.805553  -1.585596   1.134240
b  10.000000  10.000000  10.000000
c  -0.474664  -0.487816   1.063223
d  10.000000  10.000000  10.000000
e   0.508310   0.216957   0.756748
f   0.034740   0.350896  -0.949703
g  10.000000  10.000000  10.000000
h   0.570360   0.420157  -0.509846

### Dates and Times

In [26]:
import datetime

In [35]:
#Today's date
print(datetime.datetime.today())

2021-09-24 14:17:20.975124

In [28]:
today = datetime.datetime.today()

In [29]:
#This year
today.year

2021

In [30]:
#This month
today.month

9

In [32]:
#Month name
today.strftime('%B')

'September'

In [33]:
#Today's date
today.day

24

In [34]:
#Today's day of week
today.strftime('%A')

'Friday'

In [40]:
#Difference between dates
day1 = datetime.date(2021,9,20)
day2 = datetime.date(2021,9,24)
print(day2-day1)

4 days, 0:00:00

In [41]:
#Create a delta of 4 days
days_delta = datetime.timedelta(days=4)
days_delta

datetime.timedelta(days=4)

In [42]:
#Get older date from delta
datetime.date.today()-days_delta

datetime.date(2021, 9, 20)

In [43]:
#Get future date from delta
datetime.date.today()+days_delta

datetime.date(2021, 9, 28)

### Merging data

In [47]:
# Create two dataframes
left = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (left)
print (right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [49]:
pd.merge(left, right, how='inner', on=None, left_on='subject_id', right_on='subject_id',
left_index=False, right_index=False, sort=True)

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     5  Ayoung       sub5     5  Betty
3     4   Alice       sub6     4  Bryce

### Concatenate data

In [51]:
whole_data=pd.concat([left,right])
print(whole_data)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
0   1   Billy       sub2
1   2   Brian       sub4
2   3    Bran       sub3
3   4   Bryce       sub6
4   5   Betty       sub5

### Grouping data

In [52]:
whole_data.groupby('subject_id')

In [53]:
whole_data.groupby('subject_id').get_group('sub5')

   id    Name subject_id
4   5  Ayoung       sub5
4   5   Betty       sub5

In [54]:
whole_data.groupby('subject_id').count()

            id  Name
subject_id
sub1         1     1
sub2         2     2
sub3         1     1
sub4         2     2
sub5         2     2
sub6         2     2

### Rolling window calculations
- DataFrame.rolling(window, min_periods=None, center=False, win_type=None, on=None, axis=0, closed=None, method='single')
    - window = size of moving window
    - min_periods = Minimum number of observations in window required to have a value (otherwise result is NA).
        - min_periods will default to the size of the window.

In [55]:
df = pd.DataFrame({'B': [0, 1, 2, np.nan, 4]})
df

     B
0  0.0
1  1.0
2  2.0
3  NaN
4  4.0

In [56]:
# Rolling sum with a window length of 2, min_periods defaults to the window length.
df.rolling(2).sum()

     B
0  NaN
1  1.0
2  3.0
3  NaN
4  NaN

In [57]:
df.rolling(2, min_periods=1).sum()

     B
0  0.0
1  1.0
2  3.0
3  2.0
4  4.0